#+title: CoderZ Summer Assignment #4
#+author: Shaurya Singh
#+OPTIONS: date:nil
#+startup: preview
#+startup: fold
#+options: toc:2
#+latex_class: chameleon

Hello everyone! This is the fourth and last assignment you will receive this
summer. By this point, all of you should have received and submitted Assignment
#1, #2, and Assignment #3, which had you learn the basics of python and
variables as well as loops, if/else statements, and operations If you still need help, feel free to email me at shaunsingh0207@gmail.com.

In Assignment #4, you will learn about functions and python modules

** Example:
#+begin_src python :results output :exports both
#!/usr/bin/python3

# Function definition is here
def printme( str ):
   "This prints a passed string into this function"
   print (str)
   return

# Now you can call printme function
printme("This is first call to the user defined function!")
printme("Again second call to the same function")
#+end_src

#+RESULTS:
: This is first call to the user defined function!
: Again second call to the same function

In the example, we input a string, but you can ask it to input anything. In the
future we will likely use integers.

